apache/nuttx/arch/arm/src/stm32h5/stm32h563xx_flash.c
/****************************************************************************
 * arch/arm/src/stm32h5/stm32h563xx_flash.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Provides standard flash access functions, to be used by the flash mtd
 * driver.  The interface is defined in the include/nuttx/progmem.h
 *
 * Requirements during write/erase operations on FLASH:
 *  - HSI must be ON.
 *  - Low Power Modes are not permitted during write/erase
 *
 * Notes:
 *   - RM0481 refers to erase blocks as "Sectors". This file uses block.
 *   - This file assumes dual bank flash memory.
 *
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/mutex.h>
#include <arch/barriers.h>

#include <stdbool.h>
#include <assert.h>
#include <errno.h>

#include "hardware/stm32_flash.h"
#include "hardware/stm32_memorymap.h"
#include "arm_internal.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define _K(x) ((x)*1024)
#define FLASH_BLOCK_SIZE _K(8)
#define FLASH_PAGE_SIZE     16

#if !defined(CONFIG_STM32_FLASH_OVERRIDE_DEFAULT) && \
    !defined(CONFIG_STM32_FLASH_OVERRIDE_B) && \
    !defined(CONFIG_STM32_FLASH_OVERRIDE_C) && \
    !defined(CONFIG_STM32_FLASH_OVERRIDE_E) && \
    !defined(CONFIG_STM32_FLASH_OVERRIDE_G) && \
    !defined(CONFIG_STM32_FLASH_OVERRIDE_I) && \
    !defined(CONFIG_STM32_FLASH_CONFIG_B) && \
    !defined(CONFIG_STM32_FLASH_CONFIG_C) && \
    !defined(CONFIG_STM32_FLASH_CONFIG_E) && \
    !defined(CONFIG_STM32_FLASH_CONFIG_G) && \
    !defined(CONFIG_STM32_FLASH_CONFIG_I)
#  define CONFIG_STM32_FLASH_OVERRIDE_E
#  warning "Flash size not defined defaulting to 512KiB (E)"
#endif

/* Override of the Flash has been chosen */

#if !defined(CONFIG_STM32_FLASH_OVERRIDE_DEFAULT)
#  undef CONFIG_STM32_FLASH_CONFIG_C
#  undef CONFIG_STM32_FLASH_CONFIG_E
#  if defined(CONFIG_STM32_FLASH_OVERRIDE_C)
#    define CONFIG_STM32_FLASH_CONFIG_C
#  elif defined(CONFIG_STM32_FLASH_OVERRIDE_E)
#    define CONFIG_STM32_FLASH_CONFIG_E
#  endif
#endif

#if defined(CONFIG_STM32_FLASH_CONFIG_I)
#  define H5_FLASH_BANK_NBLOCKS    128
#elif defined(CONFIG_STM32_FLASH_CONFIG_G)
#  define H5_FLASH_BANK_NBLOCKS    64
#elif defined(CONFIG_STM32_FLASH_CONFIG_E)
#  define H5_FLASH_BANK_NBLOCKS    32
#elif defined(CONFIG_STM32_FLASH_CONFIG_C)
#  define H5_FLASH_BANK_NBLOCKS    16
#elif defined(CONFIG_STM32_FLASH_CONFIG_B)
#  define H5_FLASH_BANK_NBLOCKS    8
#else
#  warning "No valid STM32_FLASH_CONFIG_x defined."
#endif

#define H5_FLASH_BANKSIZE   (FLASH_BLOCK_SIZE * H5_FLASH_BANK_NBLOCKS)
#define H5_FLASH_NBLOCKS    (2 * H5_FLASH_BANK_NBLOCKS)
#define H5_FLASH_TOTALSIZE  (2 * H5_FLASH_BANKSIZE)
#define H5_FLASH_NPAGES     (H5_FLASH_TOTALSIZE / FLASH_PAGE_SIZE)

#define FLASH_KEY1      0x45670123
#define FLASH_KEY2      0xCDEF89AB
#define FLASH_OPTKEY1   0x08192A3B
#define FLASH_OPTKEY2   0x4C5D6E7F
#define FLASH_OBKKEY1   0x192A083B
#define FLASH_OBKKEY2   0x5E7F4C5D

#define FLASH_ERASEDVALUE     0xffu
#define FLASH_ERASEDVALUE_DW  0xffffffffu
#define FLASH_TIMEOUT_VALUE   5000000   /* 5s */

#define FLASH_OTP_SIZE              2048           /* OTP area size: 2048 bytes */
#define FLASH_OTP_BLOCK_SIZE        64             /* 32 words * 2 bytes = 64 bytes per block */
#define FLASH_OTP_TOTAL_BLOCKS      32             /* Total OTP blocks (0-31) */
#define FLASH_OTP_WORDS_PER_BLOCK   32             /* 32 words per block */
#define OTP_WORD_SIZE               2              /* 16-bit words as per manual */

#define FLASH_NSSR_ALL_ERRORS  (FLASH_NSSR_BSY | FLASH_NSSR_WBNE |       \
                                FLASH_NSSR_DBNE |FLASH_NSSR_EOP |        \
                                FLASH_NSSR_WRPERR | FLASH_NSSR_PGSERR |  \
                                FLASH_NSSR_STRBERR | FLASH_NSSR_INCERR | \
                                FLASH_NSSR_OBKERR | FLASH_NSSR_OBKWERR | \
                                FLASH_NSSR_OPTCHANGERR )

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32h5_flash_priv_s
{
  uint32_t base;    /* FLASH base address */
  uint32_t stblock; /* The first block number */
  uint32_t stpage;  /* The first page number */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct stm32h5_flash_priv_s flash_bank1_priv =
{
  .base    = STM32_FLASH_BANK1,
  .stblock = 0,
  .stpage  = 0
};
static struct stm32h5_flash_priv_s flash_bank2_priv =
{
  .base    = STM32_FLASH_BANK2,
  .stblock = (H5_FLASH_NBLOCKS / 2),
  .stpage  = (H5_FLASH_NPAGES / 2),
};

static mutex_t g_lock = NXMUTEX_INITIALIZER;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: flash_bank
 *
 * Description:
 *    Returns the priv pointer to the correct bank
 *
 ****************************************************************************/

static inline
struct stm32h5_flash_priv_s * flash_bank(size_t address)
{
  struct stm32h5_flash_priv_s *priv = NULL;

  if (address >= flash_bank1_priv.base &&
      address < flash_bank1_priv.base + H5_FLASH_BANKSIZE)
    {
      priv = &flash_bank1_priv;
    }
  else if (address >= flash_bank2_priv.base &&
           address < flash_bank2_priv.base + H5_FLASH_BANKSIZE)
    {
      priv = &flash_bank2_priv;
    }

  return priv;
}

/****************************************************************************
 * Name: flash_unlock_nscr
 *
 * Description:
 *    Unlock the non-secure control register.
 *
 ****************************************************************************/

static void flash_unlock_nscr(void)
{
  while (getreg32(STM32_FLASH_NSSR) & FLASH_NSSR_BSY)
    {
    }

  if (getreg32(STM32_FLASH_NSCR) & FLASH_NSCR_LOCK)
    {
      putreg32(FLASH_KEY1, STM32_FLASH_NSKEYR);
      putreg32(FLASH_KEY2, STM32_FLASH_NSKEYR);
    }
}

/****************************************************************************
 * Name: flash_lock_nscr
 *
 * Description:
 *    Lock the non-secure control register.
 *
 ****************************************************************************/

