apache/nuttx/arch/arm/src/stm32h5/stm32h563xx_flash.c
static void flash_lock_nscr(void)
{
  modifyreg32(STM32_FLASH_NSCR, 0, FLASH_NSCR_LOCK);
}

/****************************************************************************
 * Name: stm32h5_israngeerased
 *
 * Description:
 *   Returns count of non-erased words
 *
 ****************************************************************************/

static int stm32h5_israngeerased(size_t startaddress, size_t size)
{
  uint32_t *addr;
  uint8_t *baddr;
  size_t count = 0;
  size_t bwritten = 0;

  if (!flash_bank(startaddress) || !flash_bank(startaddress + size - 1))
    {
      return -EIO;
    }

  addr = (uint32_t *)startaddress;
  while (count + 4 <= size)
    {
      if (getreg32(addr) != FLASH_ERASEDVALUE_DW)
        {
          bwritten++;
        }

      addr++;
      count += 4;
    }

  baddr = (uint8_t *)addr;
  while (count < size)
    {
      if (getreg8(baddr) != FLASH_ERASEDVALUE)
        {
          bwritten++;
        }

      baddr++;
      count++;
    }

  return bwritten;
}

/****************************************************************************
 * Name: flash_wait_for_operation()
 *
 * Description:
 *   Wait for last write/erase operation to finish
 *   Return error in case of timeout
 *
 * Returned Value:
 *     Zero or error value
 *
 *     -EBUSY: Timeout while waiting for previous write/erase operation to
 *             complete
 *
 ****************************************************************************/

static int flash_wait_for_operation(void)
{
  int i;
  bool timeout = true;

  UP_DSB();

  for (i = 0; i < FLASH_TIMEOUT_VALUE; i++)
    {
      if (!(getreg32(STM32_FLASH_NSSR) &
          (FLASH_NSSR_BSY | FLASH_NSSR_DBNE | FLASH_NSSR_WBNE)))
        {
          timeout = false;
          break;
        }

      up_udelay(1);
    }

  if (timeout)
    {
      return -EBUSY;
    }

  return 0;
}

/****************************************************************************
 * Name: flash_unlock_opt
 *
 * Description:
 *   Unlock the flash option bytes
 *
 ****************************************************************************/

static bool flash_unlock_opt(void)
{
  bool was_locked = false;

  while (getreg32(STM32_FLASH_NSSR) & FLASH_NSSR_BSY)
    {
    }

  if (getreg32(STM32_FLASH_OPTCR) & FLASH_OPTCR_OPTLOCK)
    {
      was_locked = true;

      putreg32(FLASH_OPTKEY1, STM32_FLASH_OPTKEYR);
      putreg32(FLASH_OPTKEY2, STM32_FLASH_OPTKEYR);
    }

  return was_locked;
}

/****************************************************************************
 * Name: flash_lock_opt
 *
 * Description:
 *   Lock the flash option bytes
 *
 ****************************************************************************/

static void flash_lock_opt(void)
{
  modifyreg32(STM32_FLASH_OPTCR, 0, FLASH_OPTCR_OPTLOCK);
}

/****************************************************************************
 * Name: stm32h5_otp_is_space_available
 *
 * Description:
 *   Validates if the memory region can be written. OTP memory may only be
 *   written once, and after writing data to a specific block - this block
 *   should be locked for writing to prevent potential overwrite attempt.
 *   Even if the 64-bytes block was only used partially, it should be locked
 *   because there is no mechanism to validate whether the memory was written
 *   or not, so the entire block is locked after write even a single bit
 *
 * Returned Value:
 *   True if there is enough consecutive bytes in OTP to store the data
 *   False otherwise
 *
 ****************************************************************************/

static bool stm32h5_otp_is_space_available(uint8_t start_block,
    uint8_t end_block)
{
  uint32_t lockbl_cur = getreg32(STM32_FLASH_OTBPBLR_CUR);

  for (uint8_t i = start_block; i <= end_block; i++)
    {
      if (lockbl_cur & (1 << i))
        {
          return false;
        }
    }

  return true;
}

/****************************************************************************
 * Name: stm32h5_otp_clear_errors
 *
 * Description:
 *   Clear all OTP error flags from previous operations
 *
 * Returned Value:
 *   Zero on success or negative error value
 *
 ****************************************************************************/

static int stm32h5_otp_clear_errors(void)
{
  uint32_t error_flags = getreg32(STM32_FLASH_NSSR) & FLASH_NSSR_ALL_ERRORS;

  UP_DSB();

  if (error_flags != 0)
    {
      putreg32(error_flags, STM32_FLASH_NSCCR);

      error_flags = getreg32(STM32_FLASH_NSSR) & FLASH_NSSR_ALL_ERRORS;
      if (error_flags != 0)
        {
          return -EAGAIN;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: stm32h5_otp_lock_block
 *
 * Description:
 *   Lock the OTP block to prevent further data changes
 *
 * Input Parameters:
 *   block_number - the number of block to lock
 *
 * Returned Value:
 *   Zero on success or negative error value
 *
 ****************************************************************************/

static int stm32h5_otp_lock_block(uint8_t block_number)
{
  int ret;
  uint32_t reg;
  bool was_locked;
  uint32_t lockbl_cur;

  if (block_number >= FLASH_OTP_TOTAL_BLOCKS)
    {
      return -EINVAL;
    }

  lockbl_cur = getreg32(STM32_FLASH_OTBPBLR_CUR);
  if (lockbl_cur & (1 << block_number))
    {
      /* Block is already locked */

      return -EACCES;
    }

  /* Wait for any ongoing flash operations */

  ret = flash_wait_for_operation();
  if (ret != 0)
    {
      return -EBUSY;
    }

  /* Check that data buffer is empty */

  reg = getreg32(STM32_FLASH_NSSR);
  if (reg & FLASH_NSSR_DBNE)
    {
      return -EBUSY;
    }

  /* Unlock option bytes for programming */

  was_locked = flash_unlock_opt();

  /* Set the bit in the OTP block lock programming register */

  modifyreg32(STM32_FLASH_OTBPBLR_PRG, 0, (1 << block_number));

  /* Start the option bytes programming sequence */

  modifyreg32(STM32_FLASH_OPTCR, 0, FLASH_OPTCR_OPTSTRT);

  /* Wait for programming operation to complete */

  while (getreg32(STM32_FLASH_NSSR) & FLASH_NSSR_BSY)
    {
    }

