apache/nuttx/arch/arm/src/stm32h5/stm32h563xx_flash.c
  /* Check for programming errors */

  reg = getreg32(STM32_FLASH_NSSR);
  if (reg & FLASH_NSSR_ALL_ERRORS)
    {
      /* Clear errors and return failure */

      putreg32(reg & FLASH_NSSR_ALL_ERRORS, STM32_FLASH_NSCCR);
      ret = -EIO;
    }
  else
    {
      /* Verify the lock was applied */

      lockbl_cur = getreg32(STM32_FLASH_OTBPBLR_CUR);
      if (!(lockbl_cur & (1 << block_number)))
        {
          ret = -EIO;
        }
      else
        {
          ret = OK;
        }
    }

  /* Re-lock option bytes if they were locked before */

  if (was_locked)
    {
      flash_lock_opt();
    }

  return OK;
}

/****************************************************************************
 * Name: stm32h5_otp_write_word
 *
 * Description:
 *   Write OTP word (16 bits total) following the manual sequence
 *   Follows steps 1-7 from the STM32H5 reference manual. Locking
 *   written block (as step 8) is done after all data is written
 *
 * Input Parameters:
 *   otp_address - OTP address (must be 4-byte aligned)
 *   data        - 16-bit data (one 16-bit words)
 *
 * Returned Value:
 *   Zero on success or negative error value
 *
 ****************************************************************************/

static int stm32h5_otp_write_word(uint32_t otp_address, const uint16_t *data)
{
  volatile uint16_t *otp_addr = (volatile uint16_t *)otp_address;
  int ret;

  /* Step 1: Check that no memory operations are ongoing */

  ret = flash_wait_for_operation();
  if (ret != OK)
    {
      return ret;
    }

  /* Verify data buffer is empty (DBNE bit) */

  if (getreg32(STM32_FLASH_NSSR) & FLASH_NSSR_DBNE)
    {
      return -EBUSY;
    }

  /* Step 2: Check and clear all error flags */

  ret = stm32h5_otp_clear_errors();
  if (ret != OK)
    {
      return ret;
    }

  /* Step 3: Set PG bit in FLASH_NSCR register */

  modifyreg32(STM32_FLASH_NSCR, 0, FLASH_NSCR_PG);

  UP_DSB();
  UP_ISB();

  /* Step 5: Write OTP word (16 bits total) */

  *otp_addr = *data;

  UP_DSB();
  UP_ISB();

  /* Step 6: Wait for BSY bit to be cleared */

  ret = flash_wait_for_operation();
  if (ret != OK)
    {
      modifyreg32(STM32_FLASH_NSCR, FLASH_NSCR_PG, 0);
      return ret;
    }

  /* Step 7: Clear PG bit */

  modifyreg32(STM32_FLASH_NSCR, FLASH_NSCR_PG, 0);

  /* Verify the write by reading back */

  if (*otp_addr != *data)
    {
      return -EIO;
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_flash_unlock
 *
 * Description:
 *   Unlock non-secure flash control
 *
 ****************************************************************************/

void stm32_flash_unlock(void)
{
  nxmutex_lock(&g_lock);
  flash_unlock_nscr();
  nxmutex_unlock(&g_lock);
}

/****************************************************************************
 * Name: stm32_flash_lock
 *
 * Description:
 *   Lock non-secure flash control
 *
 ****************************************************************************/

void stm32_flash_lock(void)
{
  nxmutex_lock(&g_lock);
  flash_lock_nscr();
  nxmutex_unlock(&g_lock);
}

/****************************************************************************
 * Name: stm32_flash_getopt
 *
 * Description:
 *   Read the current flash option bytes from FLASH_OPTSR_CUR and
 *   FLASH_OPTSR2_CUR registers.
 *
 * Input Parameters:
 *   opt1 - result from FLASH_OPTSR_CUR
 *   opt2 - result from FLASH_OPTSR2_CUR
 *
 ****************************************************************************/

void stm32_flash_getopt(uint32_t *opt1, uint32_t *opt2)
{
  *opt1 = getreg32(STM32_FLASH_OPTSR_CUR);
  *opt2 = getreg32(STM32_FLASH_OPTSR2_CUR);
}

/****************************************************************************
 * Name: stm32_flash_optmodify
 *
 * Description:
 *   Modifies the current flash option bytes, given bits to set and clear.
 *
 * Input Parameters:
 *   clear1 - clear bits for FLASH_OPTSR
 *   set1   - set bits for FLASH_OPTSR
 *   clear2 - clear bits for FLASH_OPTSR2
 *   set2   - set bits for FLASH_OPTSR2
 *
 * Returned Value:
 *   Zero or error value
 *
 *     -EBUSY: Timeout waiting for previous FLASH operation to occur, or
 *             there was data in the flash data buffer.
 *
 ****************************************************************************/

int stm32_flash_optmodify(uint32_t clear1, uint32_t set1,
                          uint32_t clear2, uint32_t set2)
{
  int ret;
  uint32_t reg;
  bool was_locked;

  ret = flash_wait_for_operation();
  if (ret != 0)
    {
      return -EBUSY;
    }

  reg = getreg32(STM32_FLASH_NSSR);
  if (reg & FLASH_NSSR_DBNE)
    {
      return -EBUSY;
    }

  was_locked = flash_unlock_opt();

  modifyreg32(STM32_FLASH_OPTSR_PRG, clear1, set1);
  modifyreg32(STM32_FLASH_OPTSR2_PRG, clear2, set2);

  modifyreg32(STM32_FLASH_OPTCR, 0, FLASH_OPTCR_OPTSTRT);

  while (getreg32(STM32_FLASH_NSSR) & FLASH_NSSR_BSY)
    {
    }

  if (was_locked)
    {
      flash_lock_opt();
    }

  return 0;
}

/****************************************************************************
 * Name: stm32_flash_swapbanks
 *
 * Description:
 *   Swaps banks 1 and 2 in the processor's memory map.  Takes effect
 *   the next time the system is reset.
 *
 * Returned Value:
 *      Zero or error value
 *
 *      -ETIMEDOUT: Timeout occurred waiting for previous operation to occur.
 *
 ****************************************************************************/

int stm32_flash_swapbanks(void)
{
  uint32_t reg;
  bool was_locked;

  if (flash_wait_for_operation())
    {
      return -ETIMEDOUT;
    }

  was_locked = flash_unlock_opt();

  reg = getreg32(STM32_FLASH_OPTSR_PRG);
  reg ^= FLASH_OPTSR_PRG_SWAP_BANK;
  putreg32(reg, STM32_FLASH_OPTSR_PRG);

  modifyreg32(STM32_FLASH_OPTCR, 0, FLASH_OPTCR_OPTSTRT);

  while ((getreg32(STM32_FLASH_OPTSR_CUR) >> 31) != (reg >> 31))
    {
    }

  if (was_locked)
    {
      flash_lock_opt();
    }

