apache/nuttx/arch/arm/src/stm32h5/stm32h563xx_flash.c
  return 0;
}

/****************************************************************************
 * Name: stm32_otp_write
 *
 * Description:
 *   Writes data to OTP section starting from the offset.
 *   The involved blocks will be locked afterward.
 *
 * Input Parameters:
 *   data   - Pointer to data buffer
 *   len    - Length of data to write
 *   offset - Offset within OTP area (0 to FLASH_OTP_SIZE-4)
 *
 * Returned Value:
 *   Zero on success or negative error value
 *
 ****************************************************************************/

int stm32_otp_write(const uint16_t *data, uint16_t len, uint32_t offset)
{
  uint32_t otp_address;
  uint16_t remaining_bytes;
  int ret;
  uint16_t i;
  uint8_t start_block;
  uint8_t end_block;
  uint16_t words_to_write;

  if (data == NULL || len == 0)
    {
      return -EINVAL;
    }

  if (offset + len > FLASH_OTP_SIZE)
    {
      return -ENOMEM;
    }

  /* Ensure 4-byte alignment for writing */

  if (offset % 4 != 0)
    {
      return -EINVAL;
    }

  start_block = offset / FLASH_OTP_BLOCK_SIZE;
  end_block = (offset + len - 1) / FLASH_OTP_BLOCK_SIZE;

  /* Calculate actual OTP address */

  otp_address = STM32_OTP_BASE + offset;

  /* Calculate number of complete 16-bit words */

  words_to_write = len / OTP_WORD_SIZE;
  remaining_bytes = len % OTP_WORD_SIZE;

  ret = nxmutex_lock(&g_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!stm32h5_otp_is_space_available(start_block, end_block))
    {
      nxmutex_unlock(&g_lock);
      return -EACCES;
    }

  /* Unlock flash for programming */

  flash_unlock_nscr();

  /* Write complete 16-bit pairs (two 16-bit words each) */

  for (i = 0; i < words_to_write; i++)
    {
      ret = stm32h5_otp_write_word(otp_address + (i * OTP_WORD_SIZE),
          data + i);

      if (ret != OK)
        {
          goto exit_with_unlock;
        }
    }

  /* Handle remaining bytes (less than OTP_WORD_SIZE bytes) */

  if (remaining_bytes > 0)
    {
      uint16_t write_word = 0xffff; /* Default erased value for unused bits */

      /* Fill the remaining bytes */

      memcpy(&write_word, data + words_to_write, remaining_bytes);

      ret = stm32h5_otp_write_word(
          otp_address + (words_to_write * OTP_WORD_SIZE), &write_word);
      if (ret != OK)
        {
          goto exit_with_unlock;
        }
    }

  for (i = start_block; i <= end_block; i++)
    {
      ret = stm32h5_otp_lock_block(i);
      if (ret != OK)
        {
          break;
        }
    }

exit_with_unlock:
  flash_lock_nscr();
  nxmutex_unlock(&g_lock);

  return ret;
}

/****************************************************************************
 * Name: stm32_otp_read
 *
 * Description:
 *   Reads data from OTP section starting from the offset
 *
 * Input Parameters:
 *   data   - Pointer to data buffer to store read data.
 *   len    - Length of data to read
 *   offset - Offset within OTP area (0 to FLASH_OTP_SIZE-4)
 *
 * Returned Value:
 *   Zero on success or negative error value
 *
 ****************************************************************************/

int stm32_otp_read(uint16_t *data, uint16_t len, uint32_t offset)
{
  uint32_t otp_address;
  uint16_t remaining_bytes;
  int ret;
  uint16_t i;
  uint16_t words_to_read;

  if (data == NULL || len == 0)
    {
      return -EINVAL;
    }

  if (offset + len > FLASH_OTP_SIZE)
    {
      return -ENOMEM;
    }

  /* Ensure 4-byte alignment for OTP reading */

  if (offset % 4 != 0)
    {
      return -EINVAL;
    }

  /* Calculate actual OTP address */

  otp_address = STM32_OTP_BASE + offset;

  /* Calculate number of complete 16-bit words */

  words_to_read = len / OTP_WORD_SIZE;
  remaining_bytes = len % OTP_WORD_SIZE;

  ret = nxmutex_lock(&g_lock);
  if (ret < 0)
    {
      return ret;
    }

  /* Wait for any ongoing operations to complete */

  ret = flash_wait_for_operation();
  if (ret != OK)
    {
      nxmutex_unlock(&g_lock);
      return ret;
    }

  /* Read complete 16-bit words */

  for (i = 0; i < words_to_read; i++)
    {
      volatile uint16_t *otp_addr = (volatile uint16_t *)(otp_address +
          (i * OTP_WORD_SIZE));
      uint16_t *dest = data + i;

      *dest = *otp_addr;
    }

  /* Handle remaining bytes (less than OTP_WORD_SIZE bytes) */

  if (remaining_bytes > 0)
    {
      volatile uint16_t *otp_addr = (volatile uint16_t *)(otp_address +
          (words_to_read * OTP_WORD_SIZE));
      uint16_t read_data = *otp_addr;

      /* Copy only the needed bytes */

      memcpy(data + words_to_read, &read_data,
          remaining_bytes);
    }

  nxmutex_unlock(&g_lock);
  return OK;
}

/****************************************************************************
 * Name: stm32_otp_getlockstatus
 *
 * Description:
 *   Get the lock status of all OTP blocks
 *
 * Returned Value:
 *   32-bit value representing lock status of blocks 0-31
 *
 ****************************************************************************/

uint32_t stm32_otp_getlockstatus(void)
{
  return getreg32(STM32_FLASH_OTBPBLR_CUR);
}

#ifdef CONFIG_ARCH_HAVE_PROGMEM

/* up_progmem_x functions defined in nuttx/include/nuttx/progmem.h
 *
 * Notes on Implementation:
 *   - The driver implementations DO NOT enforce memory address boundaries.
 *     For processors with less than 2MB flash, the user is responsible for
 *     not writing to memory between banks.
 *
 */

size_t up_progmem_pagesize(size_t page)
{
  return FLASH_PAGE_SIZE;
}

ssize_t up_progmem_getpage(size_t addr)
{
  struct stm32h5_flash_priv_s *priv;

  priv = flash_bank(addr);

  if (priv == NULL)
    {
      return -EFAULT;
    }

  return priv->stpage + ((addr - priv->base) / FLASH_PAGE_SIZE);
}

size_t up_progmem_getaddress(size_t page)
{
  struct stm32h5_flash_priv_s *priv;

  if (page >= H5_FLASH_NPAGES)
    {
      return SIZE_MAX;
    }

  priv = flash_bank(STM32_FLASH_BASE + (page * FLASH_PAGE_SIZE));
  return priv->base + (page - priv->stpage) * FLASH_PAGE_SIZE;
}

size_t up_progmem_neraseblocks(void)
{
  return H5_FLASH_NBLOCKS;
}

bool up_progmem_isuniform(void)
{
  return true;
}

ssize_t up_progmem_ispageerased(size_t page)
{
  size_t addr;
  size_t count;
  size_t bwritten = 0;

  if (page >= H5_FLASH_NPAGES)
    {
      return -EFAULT;
    }

