apache/nuttx/arch/arm/src/stm32h5/stm32h563xx_flash.c
  /* Verify */

  for (addr = up_progmem_getaddress(page), count = up_progmem_pagesize(page);
       count; count--, addr++)
    {
      if (getreg8(addr) != FLASH_ERASEDVALUE)
        {
          bwritten++;
        }
    }

  return bwritten;
}

size_t up_progmem_erasesize(size_t block)
{
  return FLASH_BLOCK_SIZE;
}

ssize_t up_progmem_eraseblock(size_t block)
{
  bool bank_swap;
  bool phy_bank1;
  int ret;
  size_t block_address = STM32_FLASH_BASE + (block * FLASH_BLOCK_SIZE);

  if (block >= H5_FLASH_NBLOCKS)
    {
      return -EFAULT;
    }

  /* If SWAP_BANK == 0: Logical bank 2 corresponds to physical bank 2
   * If SWAP_BANK == 1: Logical bank 2 corresponds to physical bank 1
   */

  bank_swap = (bool)(getreg32(STM32_FLASH_OPTSR_CUR) &
                     FLASH_OPTSR_CUR_SWAP_BANK);

  if ((!bank_swap && block >= H5_FLASH_BANK_NBLOCKS) ||
      (bank_swap && block < H5_FLASH_BANK_NBLOCKS))
    {
      phy_bank1 = false;
    }
  else
    {
      phy_bank1 = true;
    }

  /* Convert logical block number into physical erase sector number for
   * placing in NSCR_SNB
   */

  block = block % H5_FLASH_BANK_NBLOCKS;

  ret = nxmutex_lock(&g_lock);
  if (ret < 0)
    {
      return (ssize_t)ret;
    }

  if (flash_wait_for_operation())
    {
      ret = -EIO;
      goto exit_with_lock;
    }

  /* Get flash ready and begin erasing single block */

  flash_unlock_nscr();

  if (phy_bank1)
    {
      modifyreg32(STM32_FLASH_NSCR, FLASH_NSCR_BKSEL, FLASH_NSCR_SER);
    }
  else
    {
      modifyreg32(STM32_FLASH_NSCR, 0, FLASH_NSCR_BKSEL | FLASH_NSCR_SER);
    }

  modifyreg32(STM32_FLASH_NSCR, FLASH_NSCR_SNB_MASK, FLASH_NSCR_SNB(block));

  modifyreg32(STM32_FLASH_NSCR, 0, FLASH_NSCR_STRT);

  /* Wait for erase operation to complete */

  if (flash_wait_for_operation())
    {
      ret = -EIO;
      goto exit_with_unlock;
    }

  modifyreg32(STM32_FLASH_NSCR, FLASH_NSCR_SER, 0);
  modifyreg32(STM32_FLASH_NSCR, FLASH_NSCR_SNB_MASK, 0);

  ret = 0;
  up_invalidate_dcache(block_address, block_address + FLASH_BLOCK_SIZE);

exit_with_unlock:
  flash_lock_nscr();

exit_with_lock:
  nxmutex_unlock(&g_lock);

  /* Verify */

  if (ret == 0 &&
      stm32h5_israngeerased(block_address, up_progmem_erasesize(block)) == 0)
    {
      ret = up_progmem_erasesize(block); /* Success */
    }
  else
    {
      ret = -EIO; /* Failure */
    }

  return ret;
}

ssize_t up_progmem_write(size_t addr, const void *buf, size_t count)
{
  struct stm32h5_flash_priv_s *priv;
  uint32_t     *fp;
  uint32_t     *rp;
  uint32_t     *ll        = (uint32_t *)buf;
  size_t       faddr;
  size_t       written    = count;
  int          ret;
  const size_t pagesize   = up_progmem_pagesize(0); /* 128bit, 16 bytes per page */
  const size_t llperpage  = pagesize / sizeof(uint32_t);
  size_t       pcount     = count / pagesize;

  priv = flash_bank(addr);

  if (priv == NULL)
    {
      return -EFAULT;
    }

  /* Check for valid address range */

  if (addr < priv->base ||
      addr + count > priv->base + (H5_FLASH_TOTALSIZE / 2))
    {
      return -EFAULT;
    }

  ret = nxmutex_lock(&g_lock);
  if (ret < 0)
    {
      return (ssize_t)ret;
    }

  /* Check address and count alignment */

  DEBUGASSERT(!(addr % pagesize));
  DEBUGASSERT(!(count % pagesize));

  if (flash_wait_for_operation())
    {
      written = -EIO;
      goto exit_with_lock;
    }

  /* Get flash ready for write */

  flash_unlock_nscr();

  modifyreg32(STM32_FLASH_NSCR, 0, FLASH_NSCR_PG);

  /* Write */

  for (ll = (uint32_t *)buf, faddr = addr; pcount;
       pcount -= 1, ll += llperpage, faddr += pagesize)
    {
      fp = (uint32_t *)faddr;
      rp = ll;

      UP_MB();

      /* Write 4 32 bit word and wait to complete */

      *fp++ = *rp++;
      *fp++ = *rp++;
      *fp++ = *rp++;
      *fp++ = *rp++;

      /* Data synchronous Barrier (DSB) just after the write operation. This
       * will force the CPU to respect the sequence of instruction (no
       * optimization).
       */

      UP_MB();

      if (flash_wait_for_operation())
        {
          written = -EIO;
          goto exit_with_unlock;
        }

      /* H5 corrects single ECC errors, so only check double errors */

      if (getreg32(STM32_FLASH_ECCDETR) & FLASH_ECCDETR_ECCD)
        {
          modifyreg32(STM32_FLASH_NSCR, FLASH_NSCR_PG, 0);
          modifyreg32(STM32_FLASH_ECCDETR, 0, FLASH_ECCDETR_ECCD);
          ret = -EIO;
          goto exit_with_unlock;
        }
    }

  modifyreg32(STM32_FLASH_NSCR, FLASH_NSCR_PG, 0);
  modifyreg32(STM32_FLASH_NSCCR, 0, ~0);

exit_with_unlock:
  flash_lock_nscr();

  if (written > 0)
    {
      for (ll = (uint32_t *)buf, faddr = addr, pcount = count / pagesize;
           pcount; pcount -= 1, ll += llperpage, faddr += pagesize)
        {
          fp = (uint32_t *)faddr;
          rp = ll;

          modifyreg32(STM32_FLASH_NSCCR, 0, ~0);

          if ((*fp++ != *rp++) ||
              (*fp++ != *rp++) ||
              (*fp++ != *rp++) ||
              (*fp++ != *rp++))
            {
              written = -EIO;
              break;
            }

          if (getreg32(STM32_FLASH_ECCDETR) & FLASH_ECCDETR_ECCD)
            {
              modifyreg32(STM32_FLASH_NSCR, FLASH_NSCR_PG, 0);
              modifyreg32(STM32_FLASH_ECCDETR, 0, FLASH_ECCDETR_ECCD);
              written = -EIO;
              break;
            }
        }

      modifyreg32(STM32_FLASH_NSCCR, 0, ~0);
    }

exit_with_lock:
  nxmutex_unlock(&g_lock);
  return written;
}

uint8_t up_progmem_erasestate(void)
{
  return FLASH_ERASEDVALUE;
}

#endif /* CONFIG_ARCH_HAVE_PROGMEM */
